[["H. K. Belvedere @hkbelvedere 7 jun 19 tweets hkbelvedere/status/1269577604488663041 the destruction of the human soul is almost complete - the masses are no more informed or enlightened than they were hundreds of years ago, but today, things are worse, there is a deeper-rooted problem, a sickness of the soul, let's go deeper - thread i was looking at old pictures of a soccer team i like yesterday, the picture was black and white and it dates from the late 1800s. I was gobsmacked when i saw how different the men looked then compared to men today. It hit me like a tonne of bricks every single one of those guys looks hard as nails, proper high t upright tough guys, how many today can say they have this kind of aura around them? Wow, what the hell happened to people over the years? It never occurred overnight, this was a gradual process over a long period the same goes for woman also, i did a thread the other week and i had some pictures of suffragette woman and they were the same, upright, confident, they had dignity and so much more self-respect about them, it all seems to have been lost somewhere along the line and replaced with gormless soulless, empty and vapid stares, and people who are just waiting to be fed into the fire, lambs for the slaughter, slaves, not just physically but more worryingly - spiritually. Let's discuss why - there are many factors but i have compiled a list as to what i think the main issues were that created this empty society - 1. Destruction of the family unit - the family unit is the cornerstone of any great civilization - with the downfall of christain values and the rise of feminism, liberalism, promiscuity, online hookup culture, its been a slippery slope for the nuclear family unit and it's now all coming home to roost, the single mothers and the dead beat scumbag fathers who the woman select for breading as a lot of them don't have a good father to vet potential partners before they get pregnant. I hope the woman who read this don't take it the wrong way, or take it personally, but we need to stop dancing around the blatant facts here and tackle this disease head-on or else we will continue marching into the fire - with sheer defiance and it will end our way of life as we know it forever. 2 - the rise of technolgy - technolgy is a gift and a curse, it has allowed us all to connect with each other 24/7 at our fingertips. We have the reach our ancestors could not even imagine - in their wildest dreams, yet, somehow, we are more isolated and disconnected than ever. Smartphones are one of the biggest culprits, they are extremely addictive and with the rise of social media over the past decade we now spend so much time sucked into a false reality its sometimes a great way to escape the harsh realities of normal life, but i feel now, the internet is now a permanent home for many people and they are becoming more and more cut off from the old physical society that used to be the foundation of our culture. Now our culture is on platforms controlled by huge centralized corporations who are more and more using censorship and ai to suppress any undesirable information being shared and more importantly repeated by a mass audience. 3 - the rise of pornography - this ties into the previous point about smartphones/internet of course. Pornography is the biggest and most understated weapon that has ever been unleashed on the general public, it has done untold damage to so many people, but it affects men more than women. Watching porn is very addictive and scientific studies have shown it literally shrinks grey matter of the brain when abused. Young guys with devilish smartphones are now growing up, jerking themselves into hell looking at more screwed up porn as they seek out new thrills each time. Porn targets men's natural instincts to spread their seed with as many women as possible and these unlimited amounts of websites and fetishes to pick from keep that lust for new content possible. We are now getting to the point where men are trying to quit or reduce the amount of porn they watch, rather than trying to find an honest and loving relationship that has longevity. The reasons they end up in this rut is also due to the first 2 points i made earlier in the thread. Its all connected - all by design. This is not an accident i'm guilty of indulging in the above issues, so please don't think i'm on some moral crusade or high horse. I was led down these dark paths myself completely unaware of the danger, so i can't judge people who have fell into the same vile trap, the horrid spider web of degradation i have managed to suppress these demons, i was lucky, i untangled my way out of the web of sin before the evil spider could devour me, i had the venom injected into my heart, but i managed to wriggle free just before my heartbeat stopped and the spider sucked out my soul you can defeat the spider also - rise up and admit you have been woefully misled and scammed - then draw your sword, your weapon from god and chop the spider's ugly little head clean off and free yourself from the web of hell! End thread. H. K. Belvedere @hkbelvedere 23 may 20 22 tweets hkbelvedere/status/1264105123837620224 how society is broken down- thread remember the days when the majority of people could agree on the main issues? Look now, every single little topic and view is balkanized and broken down along much more varied and solid parameters. Guilty of this myself. I could name 5/ issues at least where i have really strong and cast iron beliefs. If you asked me what my view on say feminism or transgender rights 5,10 years ago, i would have shrugged my shoulders and said fuck all to do with me, don't care but now i can tell you all about this stuff, and why i think it has been promoted and who wants to push it into the public domain etc. Why is it now that people are so staunchly behind all these new constructs that are really a load of bs when you get to the substance behind it all. Here why i think this - maybe a decade or so ago, the ruling class was aware to a certain extent that the masses were becoming wiser via easy access to uncensored information. This was a side effect of having the internet mainstream that they maybe underestimated in the early days. You see, you can't beat the honest human rating system, this is why big tech companies are becoming more hard-line with censorship, its because the wrong people for the system always end up being the people's favorites and they can't compete with it. The people naturally gravitate to what they see as genuine discourse and debates, youtube, facebook & co are digging their own graves punting people off for wrong think. It will blow up in their face eventually. You cant have a central committee like the politoboro in prc deciding what the perception of our life should be because that's all that media is for, it builds perception, its a very crucial method of control for the ruling class, its more important than any other element of the system, the finance sector is a close second. Our minds have been honeycombed off into more shattered pieces by our insatiable lust for new and ever-changing information. We now stand so united on many fronts but divided on more, and it's not by accident either, oh no, you see, they want us to think everything is random this story, that story, 9/11, covid 19. It's all by chance, pure random. I can tell you, after over a decade deep-level research and direct personal experience with uk military intelligence, special forces & occult, this is simply not true. Everything is planned. Time is round it's a big loop, it goes round and round, sometimes clockwise sometimes anti- clockwise, a ruler is called a ruler because it measures scale, but there is no scale. Let that sink in, a ruler is a rule to keep us in a mental cage. I bet a lot of you guys reading this, used to love bending the ruler at school? This is because subconsciously you knew there was more to life than met the eye, something beyond the five senses that you can feel but cannot see? Everyday simple words and phrases program us more than we can imagine, when the police officer asks you, do you understand? That means, do you stand under me? It's all verbal/social contracts we enter into in everyday life and we don't even know it half the time. In the older times, as now deceased globalist zbigniew brenzki once said it used to be easier to control a million people than to kill a million people, this is no longer the case and he was correct when he said that. Obviously, they can't just kill everybody these days so easy, so they need to frazzle our minds and program us into thinking the way we do. I don't think many (very few) people actually have much self-direction or real agency, our minds are conditioned for slavery. This is how you break down a person and therefore society. It is known fact victims of trauma (especially childhood) honeycomb their minds off into multiple different personalities, it's basically that effect on a mass scale. Fear is the ultimate tool of control. You see, fear is the most honest emotion, you can't really fake fear can you? Think about this, if you are genuinely scared of somebody, no matter how smart or low iq they are, they will know for a fact you fear them, you cant avoid this. You can tell some chick you really love her, and she will really believe it, and you could have zero interest and drop her a moment's notice, love is overrated in terms of how it's perceived, fear is not the same. The ruling class knows this and they use it over and over again, and people always fall for it, we have seen this more blatantly than ever in 2020. Now with the rapid expansion of government surveillance and control i fear we are entering into the next phase of the breakdown, this is called the post-human error ai and automation will now be very quickly rolled out across the board, we are seeing this with 5g being installed everywhere. The people don't want or need 5g, how many folks do you know who are wanting a 5g phone? I bet very few or none. It's not for us, it's for the driverless cars, it's for the technology they plan to place inside you, it's for the internet of things, where every single thing we buy, will have an electrical/digital signal/chip and all the data and information will be monitored and stored. But not all lost. I know think the system has overstepped the line, i feel now, we shall see a huge human kickback to this nightmarish set up they are dragging us into. We must come together and regain our basic human connection. For that is what they fear the most. We are a lot more powerful than we are allowed to think. Have a great weekend all. End thread. H. K. Belvedere @hkbelvedere 30 may 21 tweets hkbelvedere/status/1266777373887823872 false flags/agent provocateurs/covert operations - thread - false flags are very commonly used military tactic to bring about a desired outcome, these attacks are done by posing as the rival military (or whatever group your attacking) to discredit their movement and give you- the moral high ground to attack and achieve your original aim. Let's talk about a famous example - the gulf of tonkin incident - in august of 1964, a us navy ship was allegedly attacked by north vietnamese torpedo boats. The incident was faked and false radar images were used to pretend a us navy ship came under attack, the president of the usa at the time, lyndon b. Johnson used this false flag to justify to congress why the usa should be more involved in north vietnam. They struggled for public support for the war prior to this. This technique is also known as problem, reaction, solution create the problem, get the desired reaction, provide a solution aka the hegelian dialectic we also saw this very recently with the covid 19 fear hype and the ongoing riots across the usa. False flags have been around for longer than the 1960s - one of the earliest events was in 1788 in a war between sweden and russia, the swedish made fake russian uniforms and attacked an isolated swedish outpost. This was the pretext for the war to begin in the first place. Adolf hitler used these tactics as an excuse to discredit the growing communist party in the weimer republic at the time, the nazi's got some mentally ill dude and dressed him in a commie outfit, set the reichstag on fire and dumped the poor guy there to take the blame - this event shocked the people in the republic and hitler's popularity skyrocketed - he was then elected into power shortly after. Once he got into power, he carried out another false flag as a pretext to invade poland - its a very effective and common tactic - a form of projection, you project a horrible crime on to your enemies and blame them for it, so you can garner sympathy and public approval to achieve your main goal. Let's skip forward to more modern times - in my native uk - on the 7th of july 2005 aka 7/7 - 4 homemade bombs were detonated on 3 underground commuter trains and one double-decker bus - 52 people were killed and a further 700 injured - the attacks shocked the uk and the whole globe to its core. However, it later came out - a crises management company - were running a simulated exercise of exactly the same event taking place, yes, this is also another very common tactic, run a training exercise that involves elements of the military, police force, emergency services, etc, this is done, as liability protection and to confuse the several thousand rank and file members of the military/emergency services, some think its a drill, some don't, it creates confusion. This is a calling card of a false flag. Look out for an exercise before or during these events - the uk pm at the time tony blair had plummeted in the approval ratings due to the shambles of the iraq war, public support was frailing, and a general election was due later that year, blair steamrolled to victory in the end, despite earlier polls projecting his defeat. In october 2019 the johns hopkins center for health security in partnership with the world economic forum and the bill and melinda gates foundation hosted event 201 - which simulated a global pandemic of a coronavirus which kills 65 million people. Regardless if your a conspiracy crackpot or not, that is highly suspect by any rational thinking person standards. It's just too much of a coincidence for me personally. There is no such thing as a coincidence - everything is pre-planned. Agent provocateurs are people who are used to carry out mini false flags to achieve their overall goal, we are currently seeing this in several cities in the usa right now, especially in minneapolis, where its been reported none of the arrested rioters/looters are actually local people. They are being sent in by whoever is instigating the trouble, most sources claim it's being funded by a mr. George soros and his son alexander, they fund the far-left groups to go and start carnage to aggravate the existing issues. Many military and police forces across the globe use agent provocateurs when they wish to make a peaceful protest violent, this gives the police an excuse to go in team handed with full riot gear and take the moral high ground away from the peaceful activists. Special forces such as the sas & delta force engage in these activities also during conflicts. During my time in the uk military, i was informed of what appeared to be iraqi insurgents, running off a uk chinook troop transporter aircraft in iraq - they were dressed as iraqi soldiers and had the headgear on and ak-47 rifles, however upon closer inspection, the men were all white and had uk accents, this is the kind of covert operations the special forces do - they will dress up as the enemy and attack their own troops. As an excuse to keep the conflict going, and secure more funding for themselves, it sounds mad, its sounds backward. It is. This world is a deeply twisted place, what actually goes on in the real world, is so far removed from what the general public believe. It would make your head spin if you actually were aware of this. I believe in this crazy year of 2020 and going forward, a lot more of this stuff will come to the light, and a lot of well-hidden secrets are going to be laid bare for the public to see. Were not in kansas anymore - end thread. H. K. Belvedere @hkbelvedere 3 jun 20 20 tweets hkbelvedere/status/1268280885939515393 review of covert think tanks, secret societies and how they influence society thread - as i'm sure you are all aware, things on planet earth just now are a little bit crazy, let's discuss what influence different think tanks & secret societies have on this current situation - the fabian society - this is a uk based leftist think tank, as you can tell from their original and very wicked logo (wolf in sheep's clothing) their intentions are most likely not good. This group invented the concept of communism/socialism. The author george orwell was a member along with several other prominent politicians such as ex pm's of the uk tony blair & gordon brown. Their communist ideology was first implemented in russia and lead to the bolshevik revolution and all the horrors that followed it afterward. The fabian society is still active - today and is very influential in steering political policy of the left in the uk and the world at large, the damage they have done since 1884 is very understated by many. They have serious clout and are not to be ignored. They also promote eugenics. The freemasons, the concept of this ancient society goes back to the mystery schools of ancient egypt and possibly even further back to babylon & atlantis. In ancient times the ruling priesthood classes knew secret knowledge but only wanted to teach the chosen few these secrets. Membership was limited to the select few and it was actually a very inclusive and secret club. These days they don't actually yield much influence or power on the world stage but their membership consists of several notable ex-presidents and other high ranking officials - the templar knights who were on the run from the vatican church on their journey back from the middle east crusades managed to escape mainland europe to scotland - there they set up the mother lodge number 0 in a place named kilwinning in the year 1140. After the formation of the bavarian illuminati in 1776, the jacobine illuminists used the freemasonic lodges that were operating in germany and all over europe to spread their luciferian doctrine and they basically took over the organization and used to it gain influence. Every single country was eventually subverted by this group and still to this very day, hold great power and influence across the globe. George washington wrote letters about this at the time which you can find at the national library of congress. The skull & bones society - this fraternity that operates out of ivy league college yale are another mysterious group whose membership boasts several prominent members such as g hw bush & his son gw bush membership is invitation only and they only select people from yale who come from the most affluent backgrounds. The rituals they do are very satanic and include mock possessions, sacrifices, and the final initiation is allegedly getting into a huge vat of feces and then having homosexual sex with each other, it's a male-only fraternity like the freemasons. They are still active and i am sure they will churn out many more world leaders in the future. The bilderberg group - this group holds serious clout in world politics. After their formation in 1954, they have influence and steered major world political decisions ever since. They meet once per year in a secret location. They are said to be kingmakers and many politicians including barrack obama, bill clinton & tony blair all attended these meetings in the same year they were elected as leaders of their respective nations. In recent years their meeting locations have been leaked by the likes of alex jones, david icke, and other alternative media figures. I attended the protest against them in watford in 2013. I believe they still hold major power and clout as all the top bankers, media, and industry moguls still attend their meetings each year. Due to public kickback they no longer hold quite as much power, but they are still dictating world policy to some degree today and they are a group you should look into more deeply. They came up with the idea of the european union and a single currency for the block. I could list several groups and go deeper but i wish to make this point now considering the mass unrest we are seeing in the world today. These people who are out rioting and protesting, getting angry, are so ignorant to the facts, they have no idea what they are actually doing the ruling class and members of the above groups are complete masters of subversion - they are highly skilled at fooling people and getting the masses to react however they see fit. People need to understand this - the end game is a one- world government, currency, and military. They are playing us all for fools, using the simple divide and conquer methods that have served them so well throughout history. They control the mainstream media narratives and this is what drives the ignorant masses to lash out, time and time again. They are lucerifian at their core and want to implement the true doctrine of lucifer on the planet - if we don't see past their silly mind games and illusions, they will succeed and the future will not be pretty. End thread h. K. Belvedere @hkbelvedere 7 jun 19 tweets hkbelvedere/status/1269577604488663041 the destruction of the human soul is almost complete - the masses are no more informed or enlightened than they were hundreds of years ago, but today, things are worse, there is a deeper-rooted problem, a sickness of the soul, let's go deeper - thread i was looking at old pictures of a soccer team i like yesterday, the picture was black and white and it dates from the late 1800s. I was gobsmacked when i saw how different the men looked then compared to men today. It hit me like a tonne of bricks every single one of those guys looks hard as nails, proper high t upright tough guys, how many today can say they have this kind of aura around them? Wow, what the hell happened to people over the years? It never occurred overnight, this was a gradual process over a long period the same goes for woman also, i did a thread the other week and i had some pictures of suffragette woman and they were the same, upright, confident, they had dignity and so much more self-respect about them, it all seems to have been lost somewhere along the line and replaced with gormless soulless, empty and vapid stares, and people who are just waiting to be fed into the fire, lambs for the slaughter, slaves, not just physically but more worryingly - spiritually. Let's discuss why - there are many factors but i have compiled a list as to what i think the main issues were that created this empty society - 1. Destruction of the family unit - the family unit is the cornerstone of any great civilization - with the downfall of christain values and the rise of feminism, liberalism, promiscuity, online hookup culture, its been a slippery slope for the nuclear family unit and it's now all coming home to roost, the single mothers and the dead beat scumbag fathers who the woman select for breading as a lot of them don't have a good father to vet potential partners before they get pregnant. I hope the woman who read this don't take it the wrong way, or take it personally, but we need to stop dancing around the blatant facts here and tackle this disease head-on or else we will continue marching into the fire - with sheer defiance and it will end our way of life as we know it forever. 2 - the rise of technolgy - technolgy is a gift and a curse, it has allowed us all to connect with each other 24/7 at our fingertips. We have the reach our ancestors could not even imagine - in their wildest dreams, yet, somehow, we are more isolated and disconnected than ever. Smartphones are one of the biggest culprits, they are extremely addictive and with the rise of social media over the past decade we now spend so much time sucked into a false reality its sometimes a great way to escape the harsh realities of normal life, but i feel now, the internet is now a permanent home for many people and they are becoming more and more cut off from the old physical society that used to be the foundation of our culture. Now our culture is on platforms controlled by huge centralized corporations who are more and more using censorship and ai to suppress any undesirable information being shared and more importantly repeated by a mass audience. 3 - the rise of pornography - this ties into the previous point about smartphones/internet of course. Pornography is the biggest and most understated weapon that has ever been unleashed on the general public, it has done untold damage to so many people, but it affects men more than women. Watching porn is very addictive and scientific studies have shown it literally shrinks grey matter of the brain when abused. Young guys with devilish smartphones are now growing up, jerking themselves into hell looking at more screwed up porn as they seek out new thrills each time. Porn targets men's natural instincts to spread their seed with as many women as possible and these unlimited amounts of websites and fetishes to pick from keep that lust for new content possible. We are now getting to the point where men are trying to quit or reduce the amount of porn they watch, rather than trying to find an honest and loving relationship that has longevity. The reasons they end up in this rut is also due to the first 2 points i made earlier in the thread. Its all connected - all by design. This is not an accident i'm guilty of indulging in the above issues, so please don't think i'm on some moral crusade or high horse. I was led down these dark paths myself completely unaware of the danger, so i can't judge people who have fell into the same vile trap, the horrid spider web of degradation i have managed to suppress these demons, i was lucky, i untangled my way out of the web of sin before the evil spider could devour me, i had the venom injected into my heart, but i managed to wriggle free just before my heartbeat stopped and the spider sucked out my soul you can defeat the spider also - rise up and admit you have been woefully misled and scammed - then draw your sword, your weapon from god and chop the spider's ugly little head clean off and free yourself from the web of hell! End thread. H. K. Belvedere @hkbelvedere 11 jun 20 93 tweets hkbelvedere/status/1271164245074481153 the bloodlines who control the globe part 1 deluxe h. K. B. Thread (short story) ***disclaimer - this information is dangerous and may cause distress in some readers*** ogs and real people - take a seat, buckle up, and prepare for a belvedere brain bomb blast bonanza planet earth currently has a population of over 6 billion people (and counting) however the concentration of money and power falls into the hands of far fewer humans when you get to the bottom of the murky rabbit hole. After over a decade of deep level research and personal - experience as an occultist, i have come to the solid conclusion that around 2 or 3 thousand people actually control every major facet of our lives and how we perceive reality, those people are members of or linked directly to 5 major bloodlines who run the whole show - let's get into these families and what they do - first up - the rothchild family. The famous banking family that started in germany in the late 1700s (they really are descendants of the tribe of dan from israel) but that's a side issue. Mayer amschel rothschild had 5 sons - he sent each one of his sons to every major european city to set up banking operations in each nation. They quickly gained huge wealth and influence and become the number one bankers in the whole globe, lending vasts amounts of money to governments who used the cash to fund many wars and conflicts throughout the 18th,19th, and 20th centuries. The family fortune today is well into the trillions and despite having a lot their power broken up since then, they still yield massive clout and influence (probably more than any other family in the world) the 3rd born son out of the 5 nathan rothchild established the banking house in london. He famously bought up every single stock in the english stock market back then after his agents spread the false claim that napoleon bonaparte defeated the british at waterloo - the prices plummeted instantly as investors dumped their stocks rapidly on the basis of false information. A few days later when the official word came back that in fact napoleon bonaparte did surrender and the british were victorious, the stock prices pumped to record highs - only now, the crafty nathan had already bought them all up for pennies on the pound, this was the day when the rothchild family took control of the british empire, the most feared superpower in the world at that time. He famously said - i care not what puppet is placed upon the throne of england to rule the empire on which the sun never sets. The man who controls the british money supply controls the british empire, and i control the british money supply.  the rothchilds went from strength to strength after the cunning acquisition of the british empire's major funding vehicles. They went on to become instrumental in creating the bank of england and the federal reserve in the usa. They are the banking top brass of the world and they also created the bank for international settlements which is regarded as the highest banking authority in the world, this is the above the imf and all major global central banks. The bank (pictured above) is designed to resemble the tower of babel from ancient babylon. This is a tip of the hat to their very long and deep occult roots. These families are obsessed with ancient cultures and their symbolism is everywhere. Let's take a look at some pictures that were leaked from a rothchild party in france from the early 70s - as you can see, they have a very dark and macabre taste and even use dissembled baby dolls as table ornaments, these people are very dark and into some very weird stuff - this is philippine mathilde camille de rothschild pictured here with a very blatant and wicked-looking devil chain on. This picture has confirmed as real as she has been pictured with the same one on in different photos. The rothchilds (like of a lot of elite bloodlines) claim to be of the jewish faith, on paper they are, but it has become apparent they are luciferian in reality and this is why is dangerous to go down the whole its the jews path - its simply not true, its a red herring. Another distraction from the ultimate truth in what we face, which is a spiritual battle between god and the devil, even if your an atheist, that does not matter, these people are not , they believe this stuff and are on board with the dark side, not god. The du pont family is another prominent bloodline of the illuminati. Founded by pierre samuel du pont de nemours when he left france during the illuminati funded french revolution. He set up shop in america and the family went on to become one of the richest families in the usa. They obtained their fortune from selling gunpowder and then later moved in the widespread chemical market, they have produced countless chemicals, from washing detergent to brake fluid for cars, you have probably seen their logo before and never thought much of it - hidden in plain view (prima facia) the family has vast lands and estates all over the usa and europe and is heavily involved with the global cabal. One of their members, sophie du pont drew this picture as a little girl looks kind of like a devil yeah? Indeed, you see, the more you look into these families and what their really into and all about, it always leads back to the same place - lucifer, satan, the devil, the occult, sick rituals involving kids, its all connected, this is the glue that holds them all together. This is one common denominator that you will find in them all. I promise you, once you find this information out, it will never leave you, life won't be the same again, one little snip and the illusion is ripped away forever. So be careful when you go down the rabbit hole, because it runs deep and its very dark. I stumbled upon this information in late 2009 and then went on a very lonely and difficult journey, digging into this subject very deeply and being mentality tortured the whole time, it's not easy trying to live life normally when you know everything you were taught was a lie and you have been mugged off your whole existence, it takes a certain type of person to be able to cope with and process this vile information. I was hoping to add more to this thread but there appears to be a limit sadly. So we can call this part 1 for now...... To be continued - end thread. The bloodlines who control the globe part 2 moving on from part 1 - let's dive into another ancient and powerful bloodline - the merovingian bloodline - this is the genetic lineage of all the major royal families of the world including the most powerful to this day - the british royal family - headed up by queen elizabeth - she is the biggest landowner on planet earth and comes from a very long line dating back to the middle east, then romania, into hungary, germany then finally into the uk. This family is very powerful to this day and the queen is still the official head of state for the uk and all the commonwealth nations. She has serious clout (some in writing, some not) but tends to take a back seat in most political affairs. The family are direct decedents of the notorious vlad the impaler - the ruler who the dracula legend was based on. He was infamous for impaling his enemies and would feast on their flesh and blood as they would slowly die from blood loss while stuck on a huge metal spike, this guy was next level savage. Vlad was from the house of draculesti and ruled with an iron fist. He kept the mighty ottoman empire from breaching eastern europe - in one dark tale, it was said he had a whole village impaled as he and his army were retreating from a lost battle against the ottomans - several weeks later, the battle-hardened ottoman army attempted to move into the town, but their soldiers could not tolerate the horrible stench or sight of the rotten corpses. It demoralized them so much, they had to turn back, which allowed vlad to regroup. His castle today is still in his native transylvania in romania. Prince charles of the uk royal family spends around six months of the year there and has a very close relationship with a local children's orphanage. Charles is very open & proud of his ruthless ancestor - he has featured in many uk mainstream newspapers speaking about his admiration for his blood guzzling great great great grandfather. Small world eh? - here is a link - prince charles, heir to dracula's blood line the romanian tourist board is to use links between the british royal family and count dracula to lure in uk tourists, it has emerged. Https: //www. Telegraph. Co. Uk/news/uknews/prince-charles/9656769/prince-charles-heir... Louis mountbatten, 1st earl mountbatten of burma - this is another prominent member of the uk royal family, he was prince phillps uncle, prince phillip is princes charles's dad. Mountbatten was very influential to charles & his brother prince andrew while they were growing up. He was also the member of the uk royal's who got jimmy saville (the disgraced ex bbc tv presenter who is now infamous for being a prolific & serial child abuser) into the inner circle of the very tight-knit family. Strange how a random working class dj from scarborough just happened to be good friends with a lord from the royal family, a very small world with these people. Prince andrew (brother of charles) recently had some bad press in relation to a mr. Jeffery epstein - now dead after hanging himself in an nyc jail (allegedly) i guess the royal family must just have seriously bad luck to be involved with all these rabid child abusers. Andrew was a very close friend of epstein's partner, a woman named ghislaine maxwell - she was a personal friend of andrew and grew up with him. Andrew admitted this in his car crash panorama interview he done late last year for the bbc here is a recently leaked photograph of the 3 of them plus other guests at a horse racing event in the uk in 2001. Again, at that level - its a very, very small world. Very tight-knit indeed. Ghislaine maxwell - was the daughter of a big media mogul named robert maxwell - she was his favorite daughter and spoke on his behalf sometimes at important meetings and events. She has not been seen for several years, but is reportedly wanted by the fbi in the usa for questioning but appears to be awol. My high-level insider source informed me she is allegedly in hiding in the uk at a rothchilds family estate. They appeared on part 1 of my thread. So what does jimmy saville, jeffery epstein, ghislaine maxwell & her father robert all have in common? I reckon they are blackmailers, that procure underage kids for abuse by elites. This is how they maintain power, corruption works by getting everybody as dirty as possible. This way, everybody has something to lose, so they are blackmailed into silence, this means they will carry out the agenda of the elite dark controllers without question because there will be very compromising footage of them doing very grim stuff to young kids. It is a very dark and underhanded world at the top, the general public is still to this day very naive to it all, but recent exposures and a global mass awaking have brought this vile information to the public domain at last, but we still need to go deeper into the rabbit hole before we actually get to the endgame of what these bloodlines and their cronies wish to achieve and who they answer to, who controls the controllers? In part 3 i will dive super deep into the abyss and touch on my own personal theories about this and where its all leading to... @threadvoice audio the bloodlines who control the globe part 3 - now, ladies and gentleman - i could name many other bloodlines and their prominent members, but i wish to move on to the bigger picture, if you want to dig deeper into that side of it, i recommend you pick up the book - bloodlines of the illuminati by fritz springmeier - he was a trailblazer at the tip of the spear fighting these people way back (he was set up and jailed/tortured for publishing that book) so please, don't take this information for granted - its risky to speak about this stuff before we go any further, i would like to take you all back, to several points in history and what many ancient cultures believed - we will start from the source. Ancient mesopotamia (now known as iraq) this was where the first know civilizations in human history started this region was home to the sumerians, akkadians, assyrians, and babylonians. They all had records and legends of a non-human force who they looked up to as gods, they named them the anunnaki the cave drawings of these deities are very bizarre indeed, they tend to be winged serpent or bird-like beings & very tall creatures, a lot taller than the humans in the same drawings. Now i understand a lot of this stuff is based on legends, but where did these ancient tablets with these fascinating carvings come from? Where did they get the idea from? It opens up a big rabbit hole indeed, is the human race really in charge of the planet we call home? In ancient islamic culture, the jinn are mentioned 29 times in the quran. The jinn is the islamic version of spirits/demons the jinn were also serpent/demon-like entities according to the ancient texts and drawings. The ancient aztecs were a civilization that is now in what we call mexico. Snakes and serpents were very important in their culture and they worshipped them, the pictures below show some of their drawings and monuments. They also took part in huge human sacrifice rituals, where the priesthood class would demand the firstborn son of each family or the gods would punish them. Tens of thousands of innocent kids were sacrificed in this way, not just by the aztecs but by many other ancient cultures. In the book of genesis from the holy bible - adam and eve were the first humans in the garden of eden, eve was tempted by a serpent who encouraged them to eat the apple which did give them some more knowledge but it also caused god to banish them from the garden. In south african zulu traditional religion, they speak of a non-human force they call the chitauri these are once again serpent-like beings. They believe these entities hollowed out the moon from another part of the solar system and brought it nearer the earth. Credo mutwa - a zulu faith healer from south africa claims to have had physical encounters with these entities, he drew what he believed he saw and this was covered by the popular author david icke several years ago in his groundbreaking book the biggest secret let's move to ancient chinese culture. Again we see several references to flying serpent-like creatures, this time they are called dragons there are countless references to them throughout all the periods of history in ancient china - i ask again, where did this come from? The jinyiwei - was the world's first secret police force based in china - their logo is pictured below. Can you see the serpents/dragons on each side? Another amazing coincidence maybe? Who knows, is extremely bizarre when you really have an open mind to this topic. The city of london is the financial capital of the world, all the major world banks are based there and pretty much every transaction goes via this small area within greater london. The city (also known as the square mile) is home to the bank of england, all the commercial banks headquarters, the rothchild family's london branch, and many other major fiscal policy institutions. The city also has many dragons/serpent-like monuments & statues. It's very obvious now there is clear and provable link between all human history and these serpent-like beings that ancient cultures all seem to either worship outright or at the very least - are heavily influenced by them. Now we must discuss what they want for us in the future in part 4 i will dig into the end game of what these entities wish to achieve and how they will use their agents and collaborators in the human realm to achieve this. They have a wicked plan for humanity and they may well be successful. I will discuss what methods i believe the cabal use to interface with these non-human entities, you see, these beings don't like to operate within our very limited range of what is called visible light they prefer to be outwith this frequency, so they can remain hidden and ultimately continue to carry out their heinous plan, because they know, the average person must be able to see it to believe it. This gives them a very distinct advantage. I will also share where the whole reptilian theory came from (david icke was not the first person) that covered this incredible topic, other people broke it to the public several years before he started to mention it in his own work, the original sources have just been suppressed so much it's very hard to find them. I will inform you all so you go and check them out. The next section will be the final part of this thread/short story and i want to really break it all down and lay it out nice and clear for you all, so we can understand it and more importantly - learn how to defeat them! To be continued......... The bloodlines who control the globe part 4 - ladies and gentleman - it is here, the final part of the bloodlines thread. In this section i will inform you guys of some great sources to look into, and where the cabal is looking to take us. Going back to the reptilian topic. Most people think the author david icke invented this theory, he does have a unique narrative on it, however, he was not the first person to talk about a reptilian race. The first trace i found of it was from a man named alex collier alex claimed he was abducted by another alien race named the andromedans and they informed him of a wide range of very outlandish information. This was back in the mid-1990s when alex went public, so you can imagine how taboo this was back then. A lot of his content went awol over the years but there still some really good videos on youtube. This one from 1994, alex speaks about the reptilian race and their collaborators. A little warning, this information is extremely out there and graphic, please approach with caution https: //www. Youtube. Com/embed/16_lzfbmcuu i don't take anything as gospel, i am just sharing the information so others can make their own minds up, if you think its nonsense, then fair enough, i shall not judge. I just like to keep an open mind, the truth is stranger than fiction another source in reference to this - william tompkins - tompkins was a us navy high-level special operations, researcher and has also gone public about the reptillians and many other races, his work is not well known, but i have found a video of him talking about this - skip to 2 mins 20 seconds and you will get to the part about the reptilians. He also has a very cool book you can purchase on amazon if you're interested - https: //www. Amazon. Co. Uk/selected-extraterrestrials-secret-think-tanks- secretaries/dp/1515217469 https: //www. Youtube. Com/embed/5bs2ygiqwi4 moving on now, what is the end goal of all this? Why are these bloodlines and their masters carrying out this heinous plot against the human race? Simple, they want more control. Every empire in the history of the human race tried to take over the world, the greeks, the romans, the british empire, the anglo/american empire, all throughout history, a small group of people always run these systems and they always want more power and control, it's not about money, they are beyond money, they want what the previous empires could never obtain - one world government, one world currency, one world military. Complete control of every facet of human life in a highly surveilled ai police state. Where total compliance is brutally enforced on all citizens. The currency they wish to use will not be normal money, it will be some kind of digital currency that is stored inside a tiny nanotech chip which will be inside your body, microsoft has already patented the technology for this they also wish to reduce the world population by around 90 percent of its current levels, this is to cleanse the earth for the return of the antichrist or lucifer, these people are seriously deranged and sick. The georgia guidestones erected by insider ted turner lays this out it all sounds pretty scary, and it is, we are now entering a post-human phase, and you will now see a rapid push to strip down the world economy, replace the police and military with ai/drones/robots and also replace the human workforce with ai/robots also. So we cant be free to work or earn an independent income, the world governments will pay people a universal payment each month to get by, this is what the furlough scheme is really all about, its a pre-curser to having the government pay people to not work. All a drip, drip, drip towards total state dependency, which of course, eventually will come with several stipulations for you to receive the money - so what can we do about this? Believe it or not, we have options and solutions if we are first willing to admit there is a serious problem. Acceptance is the first step to dealing with any issue. I recommend people start growing up fast, because we don't have long left to turn this around now. I recommend you do the following - - do not watch mainstream news/buy newspapers etc (the cabal own them all) - inform start getting vocal and telling people about this, be the weirdo, be the brave one - educate yourself, we still have a pretty much-uncensored web, use it while it remains this way - don't wallow in fear - they feed on our fear more than anything) raise your energy up. - get fit, get healthy, this gives you a solid foundation to defeat fear and be self- confident - get active, write about this stuff, alert people, stand up, and take part in the true battle for the future. - have kids, don't be scared out of having kids, bet on the future. If we don't take action on mass now, we are going to go into a period of extreme difficulty and the whole human race will suffer for generations. I believe we can beat this, and i believe even if we don't win this round, we will win eventually as long as we keep fighting. One thing i have noticed from deeply studying history is - when big empires get to a point, they become so arrogant and out of control, they tend to push too far, and the people hit a breaking point and snap - then the collapse starts. They take so much, and then they start to fight back, but it's a never-ending battle, we can never defeat all evil but if we don't consciously fight it, it will take over and keep coming back again and again. We must become warriors of the mind and take our perception back these elites and all their complex system have us under the false impression, they yield all this power over us, but the truth is - they don't, they only have the intelligence to make us believe that they do - so many fall for this time and time again. We need to now, light the fire of the human soul again, we need to use our far greater power to put a stop to this degenerate culture, the constant lies and disinformation, the manipulation we are under just now is incredible, its never been more over the top. I have faith in the human race, i know god is real and i know this is all big test. So i'm calling for you all, to stand up and get right with god (or allah etc, whatever you relate to) and take the fight back to these disgusting energy vampires and banish them from our minds! Thank you for reading this 4 part deluxe thread. The end.................. H. K. Belvedere @hkbelvedere 19 jun 20 25 tweets hkbelvedere/status/1274037215769829377 the deep-rooted beta male programming of western boys/men. Thread - i see the demand for this thread in my previous tweet. - so i shall dive deeper and give you all my take on this topic that has affected so many men in western society. Let's get into it - why do so many men in the west struggle in their day to lives? They don't have the girls they really want, they don't have the source of income they really want, they don't get the respect they feel they deserve - there are many factors - but let's focus on the fact so many lost western males have been systematically programmed to be passive, non-aggressive, weak, pandering sacks of garbage. Please don't take that wrong way fellas i was once that very man i just described but i got myself out of the black hole of beta-dom several years ago and now - i'm going to break down, why it has happened to many guys who will be reading this thread - i have split it into 3 main sections - 1. Cultural programming (tv, movies, music) 2. Educational programming (schooling) 3. Chemical programming (soy, estrogen, booze) cultural programming (tv, movies, music) - let's reflect on our past guys, what was the biggest and most popular tv/movies/songs you enjoyed growing up? Of course, different locations and age groups will have different answers, but i shall share what mine were personally - tv show - friends - a very popular show that was first out in the mid-1990s. At the time i was around 10 yo i remember how hyped up it was and it was always on in my household. Over the next decade or so it became one the biggest shows of all time, with tens of millions - of views worldwide. In the final season, the main cast was paid 1 million usd per show reportedly. From what i remember the men in the show were extremely passive, nonmacho, non-dominant, & always pandered to the woman and they all just lived happily as friends this idea alone is utter bs. Men and women can't really be friends it never works in reality as general rule of thumb. However, this poisonous show portrayed a very fake male/female dynamic that does not play out in the real world. When the male characters would enter into romances with the main female characters or other females in the show, it was always a cringe-worthy pandering-fest to get da gurl looking back, it actually disgusts me what i watched as a young kid. If you, as a man, go out into the real world and act like that - you will fail. Avoid. Educational programming. Ok, this is another big one. Schools, who remembers the good old days? Walking into school and having your mind mushed into mincemeat each day? Great times! No, the school was a pro-feminist hell hole, the vast majority of the teachers were a lazy woman who only did the job for a longer summer holiday and a petty power trip. Sure, some had noble intentions, but very few. Even the male teachers were cucks as far as i remember. Alpha male behavior was never rewarded, you were encouraged to be a simpleton and berated for being a based chad type guy. It was all by design. The majority of teachers came from universities that also promoted this behavior. You would be suspended for beating somebody up, but gave a cuddle for crying. P. S this ain't a dig at woman its just the stone-cold facts. Boys are not provided enough activities at school to release anger and aggression, i know its wrong to beat people up, but schools should have had systems in place to channel this energy, rather than guilt-tripping young lads, just for being lads. This adds to the overall beta programming and discourages boys from becoming more alpha in later life. You get a pat on the back for acting like a little delicate flower. This is a key reason why so many men are weak. I dread to think about what schools are like these days in the west, it must be hellish chemical programming (soy, estrogen, booze) chemicals have played a huge role in keeping men in a beta male state. Soy - well known chemical that is contained in all the animals we eat as they are fed it, and much other food. Its is proven to decrease testosterone and increase estrogen in males, this is what has to lead the famous soy face meme, as being lower in t makes a man more likely to smile like a demented joker face with his mouth wide open, as if, he is ready to receive a large object inside it. Not a good look lads. Avoid. Alcohol - this is a big one, it's the most commonly used drug in the history of the planet, especially in the uk where i'm from, we have a huge drinking culture and every single social event is pegged with booze, usually large and very harmful amounts. It is a terrible substance for a man, it will give you titties and a fat belly plus, make you more emotional as it raises estrogen levels like soy does. I had a very bad friendship with booze from quite a young age until my mid-20s. I now consume none of it. Its utter trash guys as i have stated in previous threads, a lot of the big songs and movies feature pandering, pathetic men who are madly in love with a woman and beg and cry to get them back. In the fantasy hollywood world, the guy chases the hot chick, and at the end - he wins her over - if you do this in real life, you will spend many nights alone, cry wanking into a sock, because woman detest needy desperate men. I won't dive too deep into songs/movies you get the picture by now i'm sure. Solutions - i have listed problems, let's talk about solutions now guys - - assess your diet/get t levels checked. - stop boozing - lift heavy weights/take up boxing, mma, muay thai - find a purpose/passion in life, don't obsess over getting woman -stop watching soy-flix, hollywood trash & listening to mainstream music. You have any idea how attractive a woman finds a man who just takes care of himself, has a direction in life, is passionate about something that ain't her? , it does not need to be a cool passion, you could collect superhero toys or stamps, just make it something that ain't her if you do these things for a long time period and find a healthy purpose/passion/hobby. I promise you all. High-quality females will gravitate towards you. It's like a universal law or some karmic rule. Woman love strong, confident, tough & upright men who can play the role of protector. I know a lot of women will say, they love guys with dad bods or slightly tubby etc. I hate to tell you guys - that's a lie. Go and research what women search for on porn sites. It ain't dad bod, or bbm they like the muscly alpha dude who can dominate them. I hope you all enjoyed this and it helps you guys going forward. Be better brothers and never pander or submit to the rancid clutches of beta-dom end thread. H. K. Belvedere @hkbelvedere 24 jun 25 tweets hkbelvedere/status/1275886396570513408 how dark magic & alchemy is used on the general public by the high wizards and warlocks of the global cabal - t. H. R. E. A. D hello, sweet sages of succoth - i'm back again with another wicked thread of mystical delights for you all. A scrumptious & wicked treat! As per my thread request tweet, this topic was the number one suggestion for the thread, so in the spirit of public demand - let's dive in and discuss these very occult topics - occult magic is very commonly used on the unware and mostly docile public, they have spells cast on them each and every day, and don't even know it! - let me give you an example. You ever had food from mcdonalds? Yes, probably at some point right? You may wish to reconsider it. Mcdonalds is a highly satanic outfit connected to the cabal. The food they produce is not real and it never breaks down, even if you leave it sitting out for several years - they even a museum in iceland (where mcdonalds is now banned) that has a decade or so old burger and fries still sitting intact - why does it not rot like normal food? Because it is cursed. You see, these companies are extremely sick at the highest levels, it ain't good people who run these organizations. Now before we go any further, i want to state the original mcdonalds family members who started the chain - were bought out of the company by a mr. Ray croc ray croc was a well-known nwo elite & member of bohemian grove (if your not aware of this, its a yearly meeting of the elites in a forest in northern california, they do very weird occult rituals and mock sacrifices) anyways, back to mcdonalds, they were also awarded in excess of over 40 million dollars of taxpayers dollars to set up branches all over the world under the guise of foreign aid. The food is vile and it will clog your insides and make you depressed, it actually tastes rotton in reality, but as they plaster it with msg and other horrid chemicals so it gives the illusion it tastes nice. (msg was first used by the japanese army in ww2 - to make the soldiers' rations taste better) you put this stuff on crap and it would be edible. Moving on - anybody ever drink pepsi? You may wish to wish to avoid this going forward. Here is a good reason why - they were using a chemical named hek-293 - which was a flavor enhancer made from aborted fetal cells dating back to the 1970s they did this up to 2011 - but then suddenly declared they were no longer using this chemical in their products, mainly due to a nationwide boycott by a pro-life group in the usa - so if you consumed pepsi up to 2011ish you probably drank some bits of dead babies. Very sick. Let's talk about another lovely chemical, that is still added to several products people buy each day - aspartame. This stuff is a sweetener used in diet and low sugar drinks to make it taste better.  what is it? You ever heard of the e-coli bacteria? Its the poo that e-coli shits out. Yes, you have probably digested the shit of a bacteria. The further you go down this rabbit hole the worse it becomes, i swear, the public is so naive and fooled it's almost unbelievable what is being done to them. Avoid aspartame, it is vile now your probably wondering, what has this got to with dark magic and alchemy? Everything - because that's what it is. When you take something that's meant to be good/fun to consume and trick people into taking it via flashy logos and marketing, that is alchemy, that is dark magic - you see, it's not some elites in a dark room summoning demons (they actually do that, however) its stuff we do in everyday life that we consider being normal - this is how the satanists operate, they get us to sign on to their wicked methods - by us giving them consent! It gives them carte blanch to keep doing it - because they can always say - well, you knew, or you never actually looked into it enough to find out the truth they prey on the mass ignorance of the masses. They can even do it more simply, they can use basic word tricks - like bill gates in 2015 when he said a deadly virus would be the biggest threat to the world going forward. This was not him predicting the futute, this was him telling us what was planned. For the same reason, i told you, and you never stopped me notice how they always wear light coloured jumpers and glasses and act all geeky and innocent, this again, is dark magic, its camouflage - to trick you. If anybody reading this wore glasses, a pink jumper and spoke calmy with any level of intelligence, you would be respected more and people would take your opinion more seriously. All a mind game, all magic. Let's look at melinda gates - she recently appeared on tv wearing an upside-down cross and a ruby red rose behind it. This means in the occult dying sun it is one of the evilest & most satanic symbols you will ever see. It means the world being burned to crisp and dying. Yet, these people act all humanitarian and as if they want to save the world and help the kids, etc. On one hand, they do, but this is again is another magic trick, satanists believe they must balance out the good deeds with the bad - so they may help x amount of people on one hand, but on the other, they do very evil stuff to more people. In their minds, this gives them karmic protection, so they can keep on doing it, over and over again. The public just adapts and accepts it anyways, so can you blame them? Who is going to stop them? They also use music for this, the lyrics in popular music are always laced with satanic words and when you play tracks in reverse you will hear these spells being cast open people - they invert everything. I keep saying this, because it's true, when you hear a world leader saying we aim to bring about prosperity and peace what they really mean we want poverty and chaos if you invert things that are said by mainstream politicos and the news networks etc, it will make a lot more sense, try it, you will see what i mean. You see, evil is always organized, and always fills the vacuum where good men/women do nothing. Unless we start getting informed and standing up collectively, things will only become worse for us all. I hope you guys enjoyed this thread - ask me any questions in the comments below - join my telegram chat here - end thread. The sages of succoth h. K. Belvedere's telegram channel. Https: //t. Me/sagesofsuccoth h. K. Belvedere @hkbelvedere 25 jun 20 18 tweets hkbelvedere/status/1276247751320383489 how to deal with friends, family members, or anybody else in your life - after you wake up. Ok, so you have awakened to the harsh realities of life, everything you ever knew, was a lie or a half-truth at best, a well-packaged story to keep you in a pre-conditioned box. Thread i know the feeling, this happened to me, many moons ago, and my first instincts were to go and tell people around me. i must tell them the truth lol big mistake, it almost always backfires, and now, i will tell you why. Say for example you are aged between 18-30 currently - and you wish to speak to your mother or father about the recent information you stumbled upon. Please remember these key facts -they are under several decades of hardcore programming. - you are their child, you're not meant to educate them - they are attached to the system (this is also known as stockholm syndrome) people come to love their abusers after so long and will defend them to the death. - for them to wake up, they would need to admit they have been scammed their whole life, very hard for most to admit to themselves. - they dont care you see folks, everybody has a path in life, a mission they feel they are on - if somebody is born to be a normie complier from cradle to grave - then sadly, that is their own choice, they probably enjoy fitting in. Let's be honest, it's a hard path being truly honest about life this is not an easy road, its a very lonely path, and it can lead to very dark alleys and places that very few will ever go. I have taken my mind places that the vast majority will never even consider. The same goes for friends you may currently have, who are asleep. They will start to drift away the more passionate and honest you become about life. I lost countless friends the more absorbed in the quest for knowledge i became, you stop enjoying the wild nights out and parties the more you realize its all a sad illusion. I remember one time in like 2010, i had been awake for a few years, but i was still kicking around with a degenerate crew and going to house parties. I still had fun and got wasted but gradually i just felt more and more like a fraud that was living a total lie - a tragic lie. Shit like that loses its appeal after you get your head screwed on properly. So get used to being a weirdo if you wish to carry on down this road, because you will be ostracised and fall away from a lot of people. Short/mid-term it's bad, but it pays off later down the line. I used to tell people openly what would happen in the world today over a decade ago, i have predicted so many major events to people around me, i now have major credibility. So it does pay to know what is going on and i admire people trying to help others. Here are some tips on how to deal with this shit from a personal level -never be down about it (this is what the controllers feed on) - don't try and wake people up (let them wake up themselves) - express yourself through better mediums, swap rants for essays, write books/blogs - accumulate money - yes, having nice clothes and a good car/house will make people take your opinions more serious (shallow yes, but look at the world lol) - keep fit, don't become docile and addicted to drugs to cope, always maintain some kind of shape, (get respected more) - try and plant seeds with people, try and ask them questions rather than ram your ideas down their throats. (people tend to believe shit if they think they thought about it first, rather than being told) -keep a positive outlook, and have other outlets that are productive never lose hope/faith, you won't get anywhere in life wallowing about the woes of the world, or the heinous plans of the satanic elite, yes it's very scary stuff, but i think they will push too far, too soon, and it may blow up in their faces. The recent events in the past few months have caused a mass awakening, people can now clearly see, they are being lied to and manipulated beyond any doubt. Some will never wake up, however, no matter how bad, but many will, as things get crazier. So don't panic and run around trying to alert people. Focus on being a good productive person, build your self up in all areas and get ready to be a leader when the time comes, because it's not far away folks. We are going to need strong, informed leaders who are ready to step in when the shit hits the fan. It's not your job to shock them out the trance, they must do this alone and in their own time. When they do, you will be waiting to guide them further once they accept what is actually happened to them first. Remember the first matrix movie? Neo had to wake himself up and follow the white rabbit, then take the red pill off his own back. This is symbolic of everybody. You can be their morpheus. End thread. H. K. Belvedere @hkbelvedere 26 jun 20 22 tweets hkbelvedere/status/1276541762920726530 the benefits of semen retention, the nature of sexual energy & how you can supercharge the law of attraction using sex magick. Ok, folks, i know i touched on this before on my pinned tweet post about the dangers of porn abuse, but i wanted to add more into it - thread first of all - this subject is a deep level esoteric secret, that has been very well hidden by the cabal and their agents. This is even more occult than the bloodlines, the non-human entities, the false flags, etc - this is the big one they dont want people to know. Real-talk example - say you are a man, your in your early 20s, you masturbate once a day or even every few days, no big deal right? No. This is false. Understand this - when you ejaculate, your brain does not know the difference between that and you actually having sex. Your mind thinks if you're ejaculating, you're doing what your soul purpose of life really is, to procreate, yes, every time you do this, your mind thinks your creating life. Stop, and take a step back, & think, what would happen if i cease to do this? Guess what, your mind panics. Why? Because you are not fulfilling your highest objective of being a human being - so funnily enough, things start to change in your favor, in order for you to procreate you instantly become more attractive! Don't believe me? Try it it does actually work, your voice will become deeper, you become less emotional and more relaxed, you will be able to hold very strong eye contact, issues that would have stressed you out before, cease to even slightly bother you. You become more manly, you become more alpha. Just from refraining from playing with yourself - and the longer you can refrain from it, the stronger your power becomes. After 2 weeks you will notice massive changes - after 1-2 months miracles will occur. I promise you. All your body fluids will get an upgrade due to the fact your system is under much less stress, yes, remember, it takes fifty drops of blood to make two drops of semen! Every single action your body undertakes is to proitsise semen production. It's a biological fact. If you can resist the very strong urge to ejaculate, whether it's via having sex or playing with yourself, you will gradually build up to dragon level energy, you may have heard certain celebs using this term, this is what they mean when they say this. Its an amazing force. Anybody heard of nicola tesla? A famous genius inventor who was light years ahead of anybody in his field? He even figured out how to extract free energy from the atmosphere, and wanted to make it public, before jp morgan had his lab burned to the ground. Guess what, he retained all his semen, he died a virgin, he committed to his work so staunchly, and he knew this highly potent sexual energy would give him the edge over all his rivals. He knew the energy could be transferred into his inventions and make them better. Which they were. Another good example is - mike tyson - he reportedly went almost 5 years in his early era, and you remember how vicious tyson was in his heyday, he was knocking out world champs for fun, and these guys were not little wimps, some of them were 18 stone 6feet 5 plus, big hard guys but young tyson, despite being quite short, was sparking them clean out with a ruthless edge that nobody else had, they all feared tyson, did semen retention give him the edge? I bet it helped him a great deal. There is a tangible force behind this stuff and makes sense when you break it down. Think about it this way, we all know now, energy is not created or destroyed, it just transfers from one point to another - if your semen is inserted into a female, it will eventually become a new life. So if you retain this base chemical, where does that energy go? It won't just disappear, it will be transmuted into other areas, that you can choose and you will have the most potent and vibrant energy source driving you forward! You ever remember any point of your life, you seen a jewish or strict islamic guy, in his early 20s, driving a brand new mercedes amg63, has 3 businesses, already married with 2 or 3 kids? How did they manage that so young? In my younger days, my jealousy and envy would tell me they must sell drugs, do bank scams, or got it all from their parents but now i understand this, i think it had a lot to do with semen retention, you see, these religions shame people for masturbation and porn use, so many of the people who practise these religions, retain semen by nature, so this gives them unlimited energy to go and manifest a better life, i, e setting up your own business, finding a good wife, having kids young. Maybe i'm wrong, but i think i may be on to something with that. Who knows, but there is something to this that makes a great deal of sense. So guys, please, try and retain as much you can, feel the massive energy increase then go and supercharge the law of attraction! So you can carve out that dream life you want. Think about this, do you think any major successful person sits and plays with himself while looking at porn? Watching another man having sex with a woman? It is the most beta, loser activity you can probably do, again, i'm not shaming anybody, i have indulged in it myself, in the past and i'm happy to admit that, but i now understand how draining and sad it really was, how pathetic, it really is, and sadly, these porn sites are the most viewed by a mile. Take back your power guys, take back your life force, do not submit your creative energy to these rancid demons via the black mirrors to hell! Retain your semen & manifest pure sex magick! In your favour! End thread. H. K. Belvedere @hkbelvedere 8 jul 20 21 tweets hkbelvedere/status/1280947712976924672 the subconscious mind, energy harvesting & how to manifest success from both these sources. This is a nice juicy one tonight, not only esoteric, but practical for everybody to apply to their own reality. Let's begin, with the subconscious mind. Thread this is where all the data is stored. Yeah, all of it, the subconscious mind is the place where all the information comes from that controls your conscious mind. People forget this key fact, then end up with a shitty life. This part of your mind must be controlled very closely. It can be like a crazy & wild like an out of control wasp or little hyperactive puppy....... If you allow it to run riot inside your mind. It's so powerful it actually manifests your subjective reality for you. So pay close attention to it and feed it the correct information. This is why every single company in the world, big and small, spends billions per year on advertising. They don't do it for nothing, they do it because it works. Yes, you see, if coca cola for example, stopped advertising, they would suffer a huge loss in sales as people would not have the subconscious awareness of the product, to go and buy it. This is how advertising works - very simple. People are shown a product via some media outlet (tv is the most popular) the person then has the image and name of the brand planted into their subconscious mind. At a later date, the person recalls this image and brand then decides they want to buy it. The conscious mind thinks, that they as a person made this decision. They never, they were programmed to make this decision manipulated via proxy. The option was put into their main data bank and stored away for future use. It works so well, these companies keep spending more and more on it, each and every year. It is a form of programming. You can program yourself too. Negative self-talk is the most common. See when you're having a bad day and feeling shit and getting emotional? I bet you start saying things like this to yourself with loads of anger & pain what is the fucking point?  i hate this fucking place i'm so sick of him or her i just want to get away from here etc etc you can relate yeah? I hope you understand, when you say these things with lots of emotional energy, your subconscious mind, remembers it all. It is all stored, so don't think those nasty internal chats you have been having with yourself won't have an impact just because you never said it out loud, they do, and they have a seriously bad effect on your life. How to combat this? Have you ever been about to do something daunting? I. E speak in front of a large crowd? Then your negative self talk kicks in and says your gonna suck at this as soon as this happens you need to reply i'm going to nail this, and everybody will be applauding after i speak chances are in reality, this will allow you to meet somewhere in the middle. But if you just let the negative self-talk win, you will perform shit and look bad. So get in control of these two areas now - 1. Curate your external programming (tv, news, shit media etc) 2. Negative self-talk (replace with confident, positive, even cocky & arrogant) if you can do these two basic steps, you will be much happier and successful. The subconscious is key to setting your mind free. Your conscious mind, is the slave to the subconscious. So be a better master to yourself! Energy harvesting - this a very occult topic. How do we harvest the energy of others? Energy is not created, it is not destroyed, it simply moves from one point, to another. It transfers its point of attention. You can train yourself to absorb this from others. It can be good or bad energy you receive, how it affects you, is completely up to you. This is an advanced tactic, don't try this if you're still struggling with negative self-talk or you still watch lots of mainstream news etc only advanced level sages can do this shit. It's pretty easy once you know-how. You simply allow all energy from everybody you know to be absorbed by you at a metaphysical level. Then (as long as you are emotionally stable) convert this energy into good positive energy for your own use. You basically become what i call an energy filter you change negative or positive energy into stronger energy, then, direct it back into what you wish to do. Negative energy (hate, jealously, envy greed) is more potent, therefore, you can get more bang for your buck. The well-known rapper 50 cent, had a lyric in one of his old tracks that said i need you to hate me, so i can use you for your energy i think the song was named hustlers ambition it's very effective if you have the correct mindset. But beware, if you are fragile you can be overwhelmed by this negative energy and it will fuck you up more than it helps you. Gotta be thick-skinned. Some people i know are master vampires of this and do it very well. I can do it also, but i don't do it as often as i could. Because as an artist, i try and keep my energy filter clean as possible because like any other filters, after so many uses, it will become clogged up and then it needs a deep cleanse to make it work again. But, i do recommend you try this, if you have a solid mind. Thanks for reading again all. I hope you learned something of value and remember to be a better master to your self and use the haters' sly comments and shitty attitude to your advantage! End thread. H. K. Belvedere @hkbelvedere 9 jul 20 18 tweets hkbelvedere/status/1281275035907502081 feminism and the destruction of patriarchal values in the west. A lot of women think feminism was all about women's liberation & rights. Sadly, this is not the case, feminism was invented by ultra high iq men, to ruin their life. Today, i will explain why. Thread the movement was funded by the cabal (again) the rockefeller family being the most instrumental in this. The cabal wanted to achieve three main objectives by doing this 1. Break up the nuclear family (the corner-stone of any civilisation) 2. Tax more people 3. Brainwash kids ok, so point number 1. This has been terrible for the west since 3rd wave feminism took its toll. This happened in the late 1960s (same time the birth control pill came out - just a coincidence lol) first, you destroy the nuclear family. Why? Because its easier to control people who do not have a solid support network around them, think about this, what kind of young girls get targetted by predators and grooming gangs? It's not girls from good strong families who look out for them, is it? Nope, its girls who come from broken homes and care units etc. You break up more families, you have more people that you can lead off the correct path. Feminism has been a massive contributor to the downfall of the family. It has single-handed created so many broken homes in the west, the damage is probably so widespread, you could not even begin to measure it. Its actually horrific how many single mothers are out there today, churning out kid after kids, with impunity, no regard for the future of the human race. Are some men at fault? Yes, there is plenty of dead beat dads around. Ladies reading this, don't be upset. I'm not mad at you, you have been a victim of a seriously vindictive and long- planned attack on the human race. Famous feminist author gloria steinem even admitted the cia was running the whole movement. Look at her snake eyes, compare her to somebody like katy perry (low iq, one-track mind) that is an evil person who knows exactly how to run high-level operations to break down society, she knows precisely what she was writing her propaganda for. See that's the thing ladies, you were completely fucking conned in the west with this bullshit. It was so blatant you never even noticed, and either did the majority of men who pandered to it, which i will forever hold it against the men of the west who came before me. Cowards can we blame them though? The programming was very advanced, and it was hammered into people from the late 60s onwards. Then in the mid/late 1990s. It was reaching its peak. The spice girls was the final nail in the coffin. Especially in the cuck uk, the home of pc bullshit. You remember how big they were in the uk? girl power you think they came up with that? That slogan was straight from the cabal playbook. 100 per cent high-level programming operation, which worked very well. After they went big, the ladette culture went mainstream this is when, for the first time in history, it was acceptable for women to act like men, go out and drink, smoke, have sex with randoms every weekend yay! Girl power! I witnessed this first hand in the uk. Zoe ball was the poster girl for it. Booze and the cig in hand yuck! That went well eh? Nope, total disaster. You see, the cabal are smart as fuck. They knew, once they got the woman into the workplaces, it would do the following - 1. Drive down wages 2. Get kids into school younger & for longer (more brainwashing) 3. Tax recipes go up! Great very calculated campaign was feminism, i could not have conjured that one up myself! Now, look at the shit show in the west today! Look at the side effects of all this now. How many women today are childless, lonely & more depressed than ever? ? The sex & the city pipe dream never really panned out, did it? I remember how women used to salivate over that show. God knows how many women moved to nyc to become marketing managers and chase mr big only to be left with a coffin-sized apartment & fuck all else. Totally conned - bigtime. Good news is, women are starting to finally see this now. They know, their ego's were took over by super vindictive high iq men, all those staunch feminist idiots had no idea, they were playing a mans game all along. Aaron russo the now deceased movie producer went public about this in 2007, youtube his name plus woman's liberation. He was close to the rockefeller family, they told him the truth. I'm glad more women are seeing this bullshit for it really is now. I do fear, it may be, too little, too late. All we can hope for now is a mass awaking to it, but i think some woman are so deluded they will simply just double down on it, rather than admit they were fooled. That's fine, let them be miserable in their own thoughts. I hope you found this educational. End thread. H. K. Belvedere @hkbelvedere 10 jul 22 tweets hkbelvedere/status/1281674767494524933 the holographic universe is everything just a figment of our imagination? I advise anyone who does not have an open mind, not to bother reading this. This is for the sages only! An expanded intellect is key to be able to comprehend this controversial topic. Thread let's begin from a point where we can all agree. Every solid object, is made up of matter which eventually breaks down into what we call atoms however, atoms themselves are not actually solid. So how can a solid object, be solid? We make it solid. Lets go deeper. Everything single thing we perceive as reality is done via the 5 senses. 1. Sight 2. Hearing 3. Smell 4. Taste 5. Touch look below - the famous all-seeing eye this is the real meaning behind it! Hidden in plain view! Nobody else will tell you this! Deep level secret these senses make up everything we experience. They receive information as a vibrational waveform which is then decoded by our senses and allows us to perceive reality in the way we do. However, i must inform you all about now. Every single thing you think is out there is not it only exists inside a tiny part of your brain which is around 2-3 cm in size. The whole universe is contained within that little space. Everything else, is an imagination, my friends. You and the whole universe is one big hologram. Sounds pretty crazy right? Sure, let me explain further. Let's talk about memories. The human mind on average stores 2.8 x 10 (20) so 280, 000, 000, 000, 000, 000, 000 bits of information in a lifetime. Scientists have asked, how can you even begin to hold all that data in such a limited space? No supercomputer ever built comes anywhere near this capacity. It is only physically possible if you use a hologram. You see, if you use holographic film and two lasers, you can store as much data as contained in two bibles into a 1 inch square of film you simply just illuminate different parts of the film with whatever data you wish to display. This is how our memory works. This ain't a conspiracy either btw this is a scientific fact. These experiments were done as far back as the 1920s neurosurgeon wilder penfield found while operating on the brains of epileptics, he would electrically stimulate different areas of their brain cells. To his surprise, he found that when he stimulated the temporal lobes the region of the brain behind the temples) his patients could relive very vivid events in their lives with extremely accurate detail. One boy recalled hearing his mother talking on the phone years before, and with a few touches of penfield's electrodes, he could recite the entire conversation. Another patient, a woman. Was stimulated to the point she was back in her old kitchen from decades ago, and could hear, her then young son out the back yard playing as a child. The list goes on and on. This is the most high-level esoteric secret of the cabal. They understand the real nature of reality, they know the supreme architect is a super high-level genius programmer who has crafted a big code we call the universe. All they do is hack into the signal just before it reaches us. They are, at the highest levels, prison warders. The use saturn to hijack the code - then the moon, to amplify the signal to the earth. The moon is not a natural moon. It is hollow has a huge base on the dark side with very scary entities. Why do you think nasa never went back? Lol, they were told to fuck off. This is why in my book, i pointed out that life is indeed an illusion. I never wanted to go that deep too soon, because i fear people may freak out and run away from the truth as its too much to handle. But, this is, what the real nature of reality is. It is one big hologram, in which we are contained in this tiny little playing field known as visible light other entities i have spoken about in previous threads, only operate outwith this band of frequency (they can enter ours) but tend not too, unless required or to interface directly with high-level cabal members during sacrifice rituals. I know it happens at a castle in the black forest in germany which the rothchild family owns. A good way to think about this, that makes more sense. Imagine, your driving your car, and you are listening to a radio station, then you change to another one, the first one still exists, it just not on the frequency of your car radio any longer. But, it is still there. You may have heard of people who consume mind-altering drugs such as lsd, dmt, etc, saying when they were on these drugs, they seen everything as a hologram or in geometric patterns? And in some cases, they met what appeared to be aliens. This is very easy to explain. Our minds are really just filters, they filter out everything and decode it down into what we experience as reality when people take these drugs, scientific data shows, the brain becomes less active. So, they see more but their brain is less active. This does not make sense? At face value, no but it does, these drugs turn off your filter, so you can see more of what is really there. That is the truth about those drugs. So be careful if you use them, god puts those filters on for a very good reason my friends. I hope this deep level thread was enjoyable and gives you hope. Just remember when shit gets tough or you fall on hard times. We are being tested in a very complex simulation which has been hacked by a demonic cabal who want to build another layer on top of this current one so they can control us, even further. This is where the agenda always heads. Now you know this, you will see it so clearly. You will wonder how you never noticed before. It's all in your head. The only way out - is in. End thread. H. K. Belvedere @hkbelvedere 21 jul 15 tweets hkbelvedere/status/1285553666141884417 the pineal gland (3rd eye) is a tiny pinecone shaped gland that sits directly in the middle of the human brain. The 3rd eye is the path to higher dimensions and the evil anti-human cabal have been doing their best to keep it shut off from us! Thread. Let's look at some evidence about the pineal gland as these diagrams show, the pineal gland cross-section is very similar to the infamous all-seeing eye that we all are familiar with - hidden in plain view once again! Another coincidence? I think not. The pineal gland also serves other function but top scientists claim they don't really know much about it (this means they can't say much about it, big difference) it secrets a hormone named melatonin - which aids with sleep as a key factor in the circadian rhythm this is the pattern in which certain hormones are released through the day. The pineal gland acts on the trigger of ambient light. This is why deepest sleep is during the darkest hours of the night/morning - this is all mainstream science. But the 3rd eye aspect of the pineal gland is a lot more occult, therefore the information is more esoteric and hidden from the masses. Let's look at some more symbols that show this. The biggest one is in the vatican. The vatican is the hq of the global cabal, they have massive influence and power and this is where the jesuits (top cabal secret fraternity) operate from. But we find the same pinecone symbolism throughout history and across the world. Why do they have this pinecone? This is a symbol of their control over our subconscious minds, our perception of reality, these monuments, statues and carvings are there to remind us, who holds the key to our 3rd eye. Its a symbol of mental & spiritually oppression! The 3rd eye gives us this (when clean and not clogged up with their poisons) higher consciousness a deeper understanding of life and death a newfound ability to control the future a sense of peacefulness and bliss extrasensory, clairvoyant, intuitive and psychic abilities expanded perception enhanced capacity for self-healing stress reduction calmness and clarity newfound sensitivity so how do we clean it from the vile trash they pump into our systems and minds each day. The pineal gland can easily get a build-up of calcium deposits through improper diet, fluoridation in tap water, and pesticide-laden foods. This is called calcification. Unknowingly - many people have this problem. So how do we get rid of it? Through your diet of course! Eating a rich plant-based diet has the effect of cleansing the body, naturally and painlessly. But you can greatly speed up that process by incorporating just a few other things - spend time in the sunlight every day: morning light starts the circadian rhythm which regulates melatonin release in the pineal gland. Sleep in complete darkness: in the evening, darkness begins the four-hour melatonin release cycle. Artificial light can interfere with - melatonin release, unsettling serotonin to melatonin production in the pineal gland. Reduce blue-light exposure: tv, mobile, and lighting with blue light can interfere with the normal release of melatonin from the pineal gland. Perform daily mindful meditation, research shows meditation can enhance brain processes to heal the pineal gland. Meditation helps produce deep brain waves and stimulate the relaxing parasympathetic nervous system. Closing your eyes helps stimulate darkness. Unlocking your 3rd is key to happiness but it has to be done often. It will be clogged up again very soon afterwards. The cabal goes to extreme lengths to keep it closed. So they can keep that pinecone - firmly in their grubby claws of death! Open your mind! End thread. H. K. Belvedere @hkbelvedere 8 aug 25 tweets hkbelvedere/status/1292022417498542082 sex transmutation - channel sex energy to manifest, attract abundance and create your reality. This is becoming a more popular topic these days. Years of deviant sex, porn abuse & lack of traditional values have desensitised people to sex and its potent energic force thread this should be more simple than it sounds, but due to the very enjoyable & addictive nature of having sex and masturbation - many fail to see the benefits of using this energy for other endeavours. Sex is very powerful. This is the function which brings new souls into flesh. Let that sink in, sex itself is a very esoteric ritual which should be taking very seriously. It's not meant for fun ok, i know some people will say well i get different girls every night blah blah that mentality is childish, ego/pride based & it's vapid & empty. Let me tell you a short story, i used to be involved with people who extremely wealthy and into very wild sex & bizarre activities. I've done extremely deviant stuff with very posh and tidy chicks and fulfilled every single sexual fantasy i ever had. I can honestly say that. & it was not because i'm some big stud, it was through being a complete and utter sex-crazed sociopath for many years. You see guys, if you are willing to be really screwed up with woman, you will find, you will end up attracting very well to do and respectable types lol. The more money they have, the higher up the social structure - the more messed up their sexual preferences will become. That doctor or lawyer chick is 99% per cent more likely to be wild than some slutty looking girl from the hood, trust me. They are into some extreme and vile stuff i can assure you. One thing i learned from being around those types and engaging in that stuff is - its very intense and gives you a huge rush, but it ultimately just leads to you a dead end. An empty place, where you will not be happy i think a lot of guys get into it because they become sexually frustrated and get bored of looking at hardcore porn, so they begin to seek out the real thing and end up in mansions at 3am with psychopathic deviants. I dont judge anybody for doing it, but i would advise you avoid sexual energy is precious. Its the most sacred ritual two humans beings can engage in. It leads to a beautiful child being birthed into reality. This is the sole purpose of sex, the dopamine hit from the orgasm is a reward for doing this, not the main objective of doing it. So, if you dont want to procreate, and you decide to abstain from sex/masturbation. This is you telling the universe, you don't want to create a life, but you sure ain't going to let that potent energy go to waste. The way to do this is to take up a creative endeavour, such as/ writing, music, art, acting etc. Or if your not creative just meditate or use the extra energy to hit the gym or exercise in some manner. Anything is better than losing that energy. Now i understand after a while, you will have sexual thoughts, you may be tempted to - either go and have sex for fun or jerk off, if you do this, don't beat yourself up, just keep it in check. But what you will find is - say you go two weeks, then decide to break the streak, you will become addicted again and suffer the chaser effect same as any addiction. So make sure, when you're on your streak, you're doing creative, physical or spiritual tasks, because that sexual energy is strong af and it needs to go somewhere. Dont just sit around and be horny, you will break sooner or later. Channel it into something. If you can't find or think about anything - simply just read books. Ok sounds boring, but i can assure you, if you retain semen and just constantly read books, you will read them quicker and remember them a lot better than you would normally. Dont ask me why. You just seem to absorb information better when you're in that state. During my longer streaks, i've eaten huge books in a matter of days and been able to remember the key information contained within them with ease. The best way is to mix it up write, read, workout, meditate etc, just keep active. If you can draw start drawing pictures, take piano lessons or something wholesome that actually benefits your mind. There is plenty of options. They just ain't dangled in front of us, like sex/porn/junk food/booze etc this is all by design, the cabal knows what we will be attracted towards, so they gave us freedom (in the west especially) but also allowed us to engage in deviant and damaging filth to stunt us mentally, so eventually, they could control us more, which they are doing now! But we dont have to submit to this, certainly not on an individual level. Let me show you some quotes from the famous author napoleon hill. These are from his famous book think & grow rich i recommend you read this book if you have not already. The emotion of sex contains the secret of creative ability. When harnessed, and redirected along other lines, this motivating force maintains all of its attributes of keenness of imagination, courage, etc. , which may be used as powerful creative forces in literature, art, or in any other profession or calling, including, of course, the accumulation of riches. Fortunate, indeed, is the person who has discovered how to give sex emotion an outlet through some form of creative effort, for [s]he has, by that discovery, lifted him to the status of a genius. Rise above the pit of depravity, become more in tune with your most vital and potent energy source, don't keep wasting it constantly. You can do better & i can promise you this, sexual energy supercharges the law of attraction. Try it and you will see exactly what i mean. Take back your vital life force. Do not submit your potent seed to the disgusting succubus demons, who wish to keep you drained and miserable! Fulfil your human potential! Why do you think porn is so available and free? Why do you think countless music videos and songs have that demonic sounding vibe and imagery? This is all programming to turn our youths into sex crazed lunatics, at the mercy of their lust. Falling into the demons pit of filth. Semen eventually becomes a new life when it's hits the egg inside the female. If you don't waste this energy, it will manifest into something else! Energy cannot be killed or created. It simply moves from one point to another! Utilise this potent fluid for creating reality! Imagine what you may have achieved in life if you never drained yourself daily? Imagine what kind of existence you would be experiencing subjectively as we speak. You can make it for it now. Don't waste anymore life force on demonic jezebels of babylonia! H. K. Belvedere @hkbelvedere 15 aug 20 18 tweets hkbelvedere/status/1294705742163968001 brain wave states operate on different frequencies depending on the current situation you are in. The most common is the beta wave. This is the normal awake day to day life state you are in most of the time. I'm going to explain why this not always good thread. Let me explain it in a more esoteric and symbolic way so you will be able to understand better. Remember the movie the matrix? I bet you do. The main character is called neo (neo cortex, the part of the brain that contains our sense of self (ego) and self-critic. Neo is an everyday guy with a boring 9-5 that does not fulfil him. Spends his spare time online hacking. Begins to ask questions. He is then put in contact with morpheus, who sends for neo and informs him of some home truths about life. This is symbolic of the change in brain waves. To begin with, in his normal life within the matrix, he is in the beta wave state. Once he takes a step back & relaxes when home at night, he enters the alpha wave state. Which allows him to start thinking clearer. Now here is the deep part, once neo enters the higher brain wave state, the agents come after him very quickly. This is what happens in real life too, myself and many other fine minds on here have stated this again and again. When you begin to level up - people around you change it's usually loser friends you have known since high school and or family members, work colleagues etc. These are symbolic of the agents, you are neo. They can sense your heightened state and try to bring you back into the mundane beta state. Where you self criticise and worry about judgement etc. You care what others think, just like the agents who are trying to pull you back into that state. Everything is esoteric when you think deeply enough. Brain waves states are crucial to getting ahead. Remember in the movie, how neo (once in the higher states) can learn a huge amount of new skills such as all the major martial arts in a very short space of time. This is why you always aim to raise your own state, as much as possible! Knowledge is power! But the vast majority of people do this. 1. Wake up (beta) 2. Do job/school (beta) 3. Come home exhausted (beta) 4. Crash out (straight into delta) they have no smooth transition between the other states! There is a reason being an alpha male is considered superior to a beta male. It's much deeper than just getting more girls or being a big tough guy. There is a solid metaphysical/scientific principle to this. Everything is esoteric! I recommend to you all. Take time to truly relax, don't use drugs or anything intense to achieve these states, however, you can reach the other stages via rigorous sports or exercise. This is because the beta waves are shut down when you're not just focusing on yourself! Example, you're in a boxing ring sparing with a competent boxer, you don't have time to worry about what some idiot said to you that day, or some other bitch ass issue you may think you have, because you're trying to avoid being punched in the gut or beak. Very healthy! But you can do this just by breathing slowly and focus on your breath (meditation basically) become aware of only your breathing and switch from beta to alpha, then alpha to delta/theta/gamma. If you can this while awake you will be able to lucid dream without actually sleeping. When we are in deep sleep we automatically enter (delta/theta/gamma) glycine helps get us to the latter stages more easily. And you know, in your dreams anything is possible! Try and get yourself out the beta wave as much as possible. It will lower your blood pressure. Make you relaxed and able to think about the bigger picture without being so stuck in your head baroque music is also good for getting into the alpha brainwaves more quickly. I also recommend you listen to music at 39.17mhz (gods frequency) everything is frequency. All the information we receive and perceive is a certain frequency wavelength information field. It is a good idea to tune this to your advantage and feed your subconscious mind with the better waves. The beta brain waves are not the best - if you wish to really think clearer and more creative. You must try and move up into the alpha/delta/theta and if your really good, the gamma waves. This is where you can achieve heightened perception. Disciplined zen buddhist monks can achieve this state via deep meditation. Be conscious of your current brain wave frequency. If you start to feel stressed you are deep in the beta state. Take a step back, take a deep breath. Relax. Nothing good comes from flapping like a budgie. H. K. Belvedere @hkbelvedere 30 aug 14 tweets hkbelvedere/status/1300017335898714112 honestly, how mad is this reality? We are pure expressions of energy contained inside very complex biological robots made out of meat. Our brains are computers/energy filter devices that literally make a holographic world appear, and even feel solid. Thread we can create solid objects in a non-solid world, we can manifest physical reality by programming the subconscious software. We are all very high tech creatures with limitless potential. So much energy, genius and wisdom all wrapped into one. How can you ever feel down? Or sad? Just take a step back. Look around you, all that activity, all that nature, all those mountains, all those buildings, everything is an illusion, everything is a holographic projection that only exists in a tiny little space inside your little round heads! We are everything and nothing at the same time. We are darkness and light co- existing, we are the alpha and omega all together. We are the summer sun and winter rain. We make it all real. We are all super genius producers by default. So please dont feel hopeless or down, sure the world we perceive to be real is far from perfect and could be a lot better, but at the same time, its all a matter of perception because it's not even a physical world, it's a holographic universe and a holographic world! What i like to remind myself is, this shit is never going to end. Death is the biggest scam out there. There is no such thing, so don't expect an ending where you get to rest in peace you won't be resting anywhere, you will go on and on forever! You may manifest in another body and start all over again, or you may go elsewhere on your journey through the space- time continuum but there is no endpoint or safe haven. The battle between good and evil is eternal, once we defeat the cabal in this dimension, we take the fight to them on the next level! Because we are the good and evil, we are simply just testing ourselves against our very own nature. The all-seeing eye is you. If you pan out from an all-seeing eye. You will not see the devil or god staring back at you, only your own face! With a very cheeky grin! Ahaha you are the be-all and end-all you are the problem & solution to every single issue you believe you have. The universe revolves around your perception, not the other way around. Seeing is not believing, believing is seeing (all inverted) win win win win win win win win win you may feel like just a little drop in the ocean, but the truth is, you are the whole entire ocean. Now, ride the metaphysical waves of reality and surf through this dream we call life. Glide the water like a great white shark. Hunting for a better existence. Love & hate, fear & happiness, pain & pleasure, night & day. It comes from the same source, the same point of attention. Its all energy, that can be converted into something else. This is alchemy. All the answers will come from within. When you obtain enough wisdom, you will find the biggest secret out there. There is no answer, only more questions. No endpoint, no conclusion, on and on, you must go. The journey is the destination! Seek contentment as you are. For many years i was depressed with a head full of bumbles bees. Dwelling on the past, dreading the future. Caught up in the spiders complex web of illusions. Its just a big trap. A grand mind game of epic proportions. But you cut yourself out the web. You put yourself into it. By believing the lie that your somehow caught up in the fallacy of time. I know it all seems so real , but it's not. This is a life of illusion and nothing more. It could be considered the ultimate practical joke. Learn to laugh at it. Laugh at yourself and how serious you are. H. K. Belvedere @hkbelvedere 22 dec 20 25 tweets hkbelvedere/status/1341294560710934528 the entertainment industry and the occult - dear god, i wonder can you save me? Illuminati want my mind soul and my body - secret society, trying to keep an eye on me ~jay z - d'evils (circa 1996) one rt = one more insight about the occult in hollywood & music business. Excellent now let's go back in time to early the 1980s. A hot young singer named madonna broke into the pop world was soon crowned the number 1 star in the music biz did she earn this by merit? Or by oath? After her early hits such as like a virgin and material girl madonna enjoyed multiple platinum albums year after year, global tours and all the bells and whistles that came with it. She even dated tupac shakur. He was a g very appealing man to most women i would imagine. Tupac was also a mega popular star back in the early and mid-90s. His early music was very street and hard-hitting, but after he was sent to prison, he was made aware of certain information while inside, about a group named the illuminati some claim the fbi was behind this.... They may have had an agent inside the prison who was trying to influence tupac to either knock him off centre or get him to join the cult, but tupac was a good soul with a good heart. On his release from jail, he started using the term killuminati in his songs tupacs music was powerful and he had a great influence over millions of people. Especially young americans who looked up to him because he was that guy bit like marvin gaye back in the day. Age 25 tupac was sadly gunned down in la. His death is still shrouded in mystery....... ***correction*** it was las vegas he died not la. His death was subject to several conspiracies and many believe he actually faked his own death so he could space the limelight. The main reason for this was he used an allies makaveli after the famous niccolo machiavelli he was renowned for faking his own death, to fool his enemies so perhaps tupac did the same. I don't believe this theory and i think he was executed because he had way too much influence (especially over black people) which is one thing the cult do not like. They seek to keep blacks in a state of victimhood and preoccupied with phoney racism issues which keep them down and in a lower vibrational energy level. For some reason they fear black empowerment and enlightenment, sadly many black artists have carried this agenda since tupac. Rap music plays a huge role and has lead to several million blacks being jailed for drug dealing/gang violence etc. It's very sad how they were brainwashed by vindictive rich men who own the big labels. Now let's move on to another area. We will go back in time again to the mid-1960s. A man named jim morrison was the lead singer of a band called the doors very popular and very catchy music. Note the one eye on the album cover. Jim morrison was very aware of the occult forces behind the music industry and he once ranted about it at a live show in miami. Listen to this now, and think about he was referring to? He was very awake way back........................................ Https: //www. Youtube. Com/embed/pfdmaga_gfo music is a very powerful tool to program people, maybe the best method of all. Illuminati insider john todd once claimed all the major recording artists have sold their soul to the devil to get into the position. There is a lot of information here. Https: //www. Youtube. Com/embed/segn1d-zmsw popular pop star katy perry admitted she sold her soul to the devil in this interview. She claimed she wanted to be a gospel signer but it never worked out, so she went a different path. Https: //www. Youtube. Com/embed/8zgoixvlrke the music industry is riddled with occult symbols and sell out artists who create music, which keeps people in lower vibrational states. Keisha is a good example of manufactured illuminati pop princess. Her image and music is vile. Her videos often feature several satanic symbols such as pentagrams and upside down crosses. Her music has the general theme which promotes being a shallow, easy and trashy women, who has no higher purpose other than getting lit at parties and being selfish. Bob dylan is very well known singer/songwriter. In all honesty much of his music is decent and well made with good intentions. But he is another big star who has mentioned the unseen forces who control the industry.... In this interview, dylan described the end of the deal he has to uphold with the chief commander of the world which we do not see. Are you getting it yet? Https: //www. Youtube. Com/embed/m_waz02jutm now then, let's move on to hollywood. Its common knowledge the devil lives in the city of la. This is the home of the big movies where all the wannabe stars go to make it big in show business. But the price for those big roles in the blockbuster movies is rather costly... Illuminati symbolism is everywhere in several movies, let me display some notable examples for you. It's very, very common. Sean connery in the man who could be king lucifer was an angel, and he was the angel of entertainment which we can now call music and movies. The devil runs hollywood and the music industry. Because its a very effective way to condition and program the masses who consume the entertainment. So bear this in mind, whenever you are listening to or watching your favourite performers. Many of them will have sworn allegiance to lucifer before they landed the deal or lucrative contract. Ask @markdice he was asked to do this to get a big national tv show, but he declined. Amy winehouse -highly popular singer from the uk. Died at 27. Here she is during a jonathon ross interview saying they tried to mould me into a triangle shape and i said no 3:34 in check it out. Https: //www. Youtube. Com/embed/qfcg0pbhkpa correction 3mins 10 seconds in h. K. Belvedere @hkbelvedere 27 dec 20 18 tweets hkbelvedere/status/1343241230805655552 belvedere's projections for 2021 bookmark & screenshot for future reference and verification. Please share far & wide to spread awareness. Disclaimer - i don't want to be right, i would rather be wrong in most cases - but i will remain honest. Thread...... As 2020 draws to an end, its now a great time to reflect and take stock of what is going on. Not just in our own lives, but across the board. Its been a very unique year, many drastic changes have taken place in most peoples lives. Let's discuss the major events of the year. Let's rewind to the first part of the year in january. President trump launched military strikes in iraq which targetted and killed a well known iranian general. Oil prices boomed, and a major war (perhaps ww3) was looming. Fortunately, this military action was limited and the chaos died down very quickly. Things began to look up again and everything seemed to be going well. Or so it seemed. In late january some concerning news came out of wuhan, china. A new flu-like virus was on the loose......... Soon, images and videos of people collapsing on the street, people being stopped at checkpoints, new hospitals being erected to look after the thousands of ill people, struck down with what we now know as coronavirus or covid-19 the virus quickly spread across the globe. Italy quickly became the european epicentre of the pandemic and soon after announced national lockdowns across the country. All non-essential businesses closed and even their highly popular serie a soccer league was halted to try and stem the spread of the virus. The rest of europe followed suit, and in a matter of 1 month or two, the world financial markets collapsed and the oil price even went to a negative price for the first time ever. Millions of peoples lives had been altered in a heartbeat. Working from home or furloughed became the new normal as the summer progressed some of the new restrictions were lifted in certain areas, and many people returned to a semi-normal existence. But government messages were unclear and often confusing. Things had been changed, and probably not for the better. Going into the winter months the confusion increased with ever-changing rules and regulations which began to drive the public to the brink of insanity. But most people, being good people wanted to do the right thing and go along with it. The vast majority did. The massive election in america between trump and biden was overshadowed in the run-up to the vote by the pandemic and the widespread protests, riots and demos by certain groups. But the election went ahead regardless and was officially declared for biden after a bizzare delay. Trump and his support base were convinced it was stolen and still maintain this view, as it stands trump is still contesting the result and has not yet conceded. Its been a wild and very strange year. On the backdrop of all this, there have been several stories of ufo/aliens coming out in the mainstream and alternative media alike. Silver monoliths have been popping up across the globe also which has sparked many interesting and weird debates about the question of alien life. So it's safe to say, everybody has had a tough year, but it's not been all bad. Many people have reconnected with what really matters in life, spending more time with family and friends away from the clutches of their soul-sucking jobs and careers. As it comes to a close - the big question is, what does 2021 hold for you as an individual and for the world as a collective? I think we can assume that now - all bets are off and anything is possible - but who is going to project in detail the events of 2021? Where will the global hot-spots be? Attempted coups? Mass protests, riots - even potential infrastructure breakdowns? What markets are going to excel? Will btc & other cryptocurrencies continue to boom? Or crash and burn in glorious failure? What will the world look like in 2021? Will we see further restrictions and lockdowns? Or will things finally get back to normal like 2019? How will brexit affect the uk and the eu as a whole? Will the powers that be release the truth about non-human entities? How will the rapid advancement of artificial intelligence impact on our day to day lives and how people work? Is it going to be a good year or more head-scrambling madness? Find out today - belvedere's projections for 2021 belvedere's projections 2021 belvedere's projections 2021a forecast for the new year. 2020 has been a crazy year. Many drastic changes have happened, and our day to day life isnt even remotely close to what it was exactly a ... Https: //gum. Co/belvederesprojections2021 events i called this year in advance - -the 2nd lockdown in the uk. -the rise of btc. -xrp being exposed. -the supreme court not backing trump. -c-19 mutation. -oklahoma city bombing type event in the usa. -g. Maxwells arrest. H. K. Belvedere @hkbelvedere 28 dec 20 26 tweets hkbelvedere/status/1343635405749542915 alchemy - a summary and a detailed breakdown of the history, methods, and meanings behind the ancient spiritual discipline & proto-chemical practice, that has been around since ancient egypt & perhaps even further back in history. Thread........................ Alchemy (al-kemet) meaning from eqypt is an ancient science and discipline which can be traced back to ancient egypt. Shrouded in secrecy and kept from the general public via a vast range of mystery schools and fraternal organisations. Its origins and true purpose are not clear the term kemet means (the black lands) it is believed this was a reference to the dark and fertile soil which was abundant in egypt. Especially along the banks of the river nile as pictured below. All the big settlements in eqypt were situated along these banks near the water. Let's discuss the origins of alchemy in more detail, so we can garner a better understanding......... The list of alchemists comes from egyptian god thoth widely acclaimed as the original author of science, religion, mathematics, geometry, philosophy, medicine & magick. His wife was known as maat & was said to be the force that maintained the universe in harmony (spirit) this male and female unification is the cornerstone of all alchemical thought it also touches on something i have tweeted previously male = matter. Female = spirit. As the teachings spread throughout time and moved to ancient greece, thoth becomes known as the greek god hermes later combined to hermes trismegistus. That was the origin of the hermetic tradition. The teachings of hermetic alchemy spread from ancient greece to rome, all across europe and then into the era of the british empire. English chemist and alchemist sir issac newton was a keen advocate of alchemy and translated a highly acclaimed manuscript the emerald tablet the real author of the tablet is unknown to this day. Here is the translation by newton - tis true without lying, certain and most true. That which is below is like that which is above and that which is above is like that which is below to do the miracle of one only thing and as all things have been and arose from one by the mediation of one: so all things have their birth from this one thing by adaptation. The sun is its father, the moon its mother, the wind hath carried it in its belly, the earth is its nurse. The father of all perfection in the whole world is here. Its force or power is entire if it be converted into earth. Separate thou the earth from the fire, the subtle from the gross sweetly with great industry. It ascends from the earth to the heaven and again it descends to the earth and receives the force of things superior and inferior. By this means you shall have the glory of the whole world and thereby all obscurity shall fly from you. Its force is above all force, for it vanquishes every subtle thing and penetrates every solid thing. So was the world created. From this are and do come admirable adaptations where of the means is here in this. Hence i am called hermes trismegist [sic], having the three parts of the philosophy of the whole world that which i have said of the operation of the sun is accomplished and ended. Now lets discuss some of the principles of alchemy. Three primes (tria prima) sulphur the omnipresent spirit of life. Mercury the fluid connection between the high and the low. Salt base matter. Spiritus, anima, and corpus (spirit, soul, and body) i believe these 3 principles are another version of the winged globe of eqypt symbol (pictured) this symbol, which appears in every masonic lodge and temple is emblematic of the three persons of the egyptian trinity. The wings, the serpents, and the solar orb are the insignia of ammon, ra, and osiris. In christianity, this became the father, son & the holy ghost. The 7 alchemical metals and their astrological connections are - gold the sun energy, life, sense of self, willpower, organisation, self-integration, vitality, success also corresponds, to the heart, spinal column & heat distribution in the body. Silver - the moon water, growth, fertility, conception, emotions, instinct, subconscious, psychic ability, collective consciousness, rhythms and cycles, genetics & cultural heritage. Its connected to the brain, female organs, stomach & all fluids in the body. Copper venus herbalism, magic, arts, music, poetry, design, theatre, harmony, proportion, integration, the formation of opposites into a whole, odours, perfumes, love, connected to the skin, kidneys, sweat, enrichment of substances within the body, sexual organs & smell. Iron mars violent energy, intent, motion, power & dominance, corresponds to the muscular system, male sexual organs, marrow, blood formation, adrenaline. Tin jupiter good health, wealth, philosophical and religious matters, ceremony, enjoyment of life, connected to the liver, artilleries of the stomach and abdomen, digestion, antibiotic function, cell growth and general energy levels. Mercury- mercury communication, commerce, initiation to the mystery schools, alchemy, kabbalah, astrology, magick, writing, agility, mental skills and speedy distribution of energy. Connected to the nerves, speech, hearing, coordination between thoughts, speech and actions/ throat, thyroid, nervous system, spinal fluid. Lead saturn old age, chronic diseases, karma, learning, connected to bones, teeth, spleen hair, minerals in the body, joints and flexibility. I dont want to overwhelm you with to information at once - so we will call this section (part 1) i will return soon and continue with the 7 practical operations of alchemy and much deeper information also. Check back soon......... To be continued.......... Many people misunderstand alchemy. They believe its simply the transmutation of one type of metal to another. And this is true on a certain level but to the enlightened - it is an ancient spiritual discipline that aims to turn unpure souls into pure souls. The concepts and images of alchemy are similar to wicca in a sense. The uninformed see these images being related 100percent to science and chemistry, but to the aware ones, they are symbols of deep spiritual wisdom."]]